# Key -> Data -> Split -> Apply -> Combine

In [18]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pl
import seaborn as sns
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randint(1,5,5),
'data2' : np.random.randint(1,5,5)})

In [20]:
df

  key1 key2  data1  data2
0    a  one      1      1
1    a  two      2      1
2    b  one      4      3
3    b  two      4      4
4    a  one      4      3

In [21]:
pd.crosstab(df['key1'],df['key2'])

key2  one  two
key1
a       2    1
b       1    1

In [22]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [23]:
grouped.mean()

key1
a    2.333333
b    4.000000
Name: data1, dtype: float64

In [25]:
means=df['data1'].groupby([df['key1'],df['key2']]).sum()
means

key1  key2
a     one     5
      two     2
b     one     4
      two     4
Name: data1, dtype: int32

In [33]:
means.unstack()

key2  one  two
key1
a       5    2
b       4    4

In [40]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
grouped=df['data1'].groupby([states,years])
grouped.mean()

California  2005    2.0
            2006    4.0
Ohio        2005    2.5
            2006    4.0
Name: data1, dtype: float64

In [43]:
df.groupby(['key1','key2']).mean()

           data1  data2
key1 key2
a    one     2.5    2.0
     two     2.0    1.0
b    one     4.0    3.0
     two     4.0    4.0

In [44]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [49]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)
    print("\n")

a
  key1 key2  data1  data2
0    a  one      1      1
1    a  two      2      1
4    a  one      4      3


b
  key1 key2  data1  data2
2    b  one      4      3
3    b  two      4      4